src/cfe/Кодерлайн_интеграция_Розница/InformationRegisters/ксп_ОтложенноеПроведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ОтложенноеПроведение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ксп_СтатусыКачестваДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Кодерлайн_интеграция_Розница/Enums/ксп_СтатусыКачестваДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ксп_СтатусыКачестваДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Кодерлайн_интеграция_Розница/CommonModules/ксп_РегламентныеЗадания/Ext/Module.bsl
#Область ОтложенноеПроведение

// Регл. задание "ксп_ОтложенноеПроведение"
Процедура ксп_ОтложенноеПроведение() Экспорт

	Выборка = ВыбратьДанныеДляПроведения();
	
КонецПроцедуры


#КонецОбласти



#Область ПроверкаКачества


// Регл. задание "ксп_ПроверкаКачестваДанных"
Процедура ксп_ПроверкаКачестваДанных() Экспорт

	ЗаписьЖурналаРегистрации("КачествоДанных",УровеньЖурналаРегистрации.Информация,,,"Старт проверки качества");
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Выборка = ВыбратьДанныеДляПроверкиКачества();
	
	КоличествоОбъектов = 0;
	Пока Выборка.Следующий() Цикл
		
		ПроверитьКачествоОдногоОбъекта(Выборка);
		
		КоличествоОбъектов = КоличествоОбъектов + 1;
	КонецЦикла;
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПрошлоВремени = ВремяОкончания - ВремяНачала;
	
	ЗаписьЖурналаРегистрации("КачествоДанных",УровеньЖурналаРегистрации.Информация,,,
		"Завершение проверки качества. Время = "+Строка(ПрошлоВремени)+" мс, Количество объектов = "
		+Строка(КоличествоОбъектов));
	
КонецПроцедуры

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ПроверитьКачествоОдногоОбъекта(Выборка)
		
КонецПроцедуры


#КонецОбласти



#Область ВыборкаДанных


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ВыбратьДанныеДляПроверкиКачества()
	
	_МассивСтатусов = Новый Массив;
	_МассивСтатусов.Добавить(Перечисления.ксп_СтатусыКачестваДокументов.Ожидание);
	_МассивСтатусов.Добавить(Перечисления.ксп_СтатусыКачестваДокументов.Ошибка);
	
	ВыбратьДанныеУниверсально(_МассивСтатусов);
	
КонецФункции

Функция ВыбратьДанныеДляПроведения() Экспорт

	ВыбратьДанныеУниверсально(Перечисления.ксп_СтатусыКачестваДокументов.ОК);
	
КонецФункции

// Параметры
//	СтатусОбъекта - ПеречислениеСсылка.ксп_СтатусыКачестваДокументов / массив
//
Функция ВыбратьДанныеУниверсально(СтатусОбъекта) Экспорт

	Если ТипЗнч(СтатусОбъекта) = Тип("ПеречислениеСсылка.ксп_СтатусыКачестваДокументов") Тогда
		_МассивСтатусов = Новый Массив;
		_МассивСтатусов.Добавить(СтатусОбъекта);
	Иначе 
		_МассивСтатусов = СтатусОбъекта;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_ОтложенноеПроведение.ДокументСсылка КАК ДокументСсылка
		|ИЗ
		|	РегистрСведений.ксп_ОтложенноеПроведение КАК ксп_ОтложенноеПроведение
		|ГДЕ
		|	ксп_ОтложенноеПроведение.СтатусОбъекта В (&_МассивСтатусов)";
	
	Запрос.УстановитьПараметр("_МассивСтатусов", _МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции


#КонецОбласти
